{
    "navigation": {
        "home": "Home",
        "experiences": "Experiences",
        "projects": "Projects",
        "recipenotes": "Recipe Notes",
        "privacy": "Privacy Policy",
        "contact": "Contact"
    },
    "home": {
        "title": "Hello!",
        "introduction": {
            "hi": "Hi, I'm Jay — a software engineer from Hong Kong, based in Tokyo, Japan.",
            "ios": "I build intuitive, user-friendly iOS applications using Swift and modern Apple frameworks, with a focus on creating smooth, elegant, and thoughtful user experiences.",
            "web": "Previously, I worked as a front-end web developer using React and TypeScript — a background that continues to shape how I think about structure, responsiveness, and design systems, now in the mobile space.",
            "love": "Beyond the screen, I'm someone who loves language, culture, and creativity.",
            "language": "I speak four languages — Cantonese, English, Mandarin and Japanese — and I enjoy working with people from diverse cultural and linguistic backgrounds. It's part of what makes collaboration feel both meaningful and natural to me.",
            "travel": "I've also explored 13 countries and visited 33 of Japan's 47 prefectures, driven by a love for culture and curiosity.",
            "music": "In my spare time, I turn to music. I play the piano and bass, and I occasionally transcribe or arrange songs just for fun.",
            "current": "I'm currently focusing on:",
            "focus": {
                "cert": "Studying for the Fundamental Information Technology Engineer Examination (基本情報技術者試験)",
                "japanese": "Improving my Japanese for both daily life and professional fluency",
                "piano": "Practicing piano regularly and arranging songs occasionally",
                "ios": "Deepening my iOS development skills with Swift, SwiftUI, and UIKit",
                "web": "Continuing to explore web development with Next.js to stay sharp with front-end trends"
            },
            "closing": "I'm always open to new ideas and fun conversations — feel free to reach out!"
        }
    },
    "experiences": {
        "title": "Experiences",
        "fulltime": {
            "title": "Full-time",
            "rakuten": {
                "name": "Rakuten Group Inc.",
                "period": "Apr 2023 - Present",
                "location": "Setagaya, Tokyo, Japan",
                "title": "Applications Engineer",
                "ios": {
                    "title": "iOS Team",
                    "description": {
                        "tbu": "Recently transitioned into the iOS team, where I'm beginning to contribute to app development. More updates soon!"
                    }
                },
                "ui": {
                    "title": "UI Team",
                    "description": {
                        "inbound": "Worked as a front-end web developer for the Rakuten Travel Inbound website",
                        "ds": "Created a unified design system used across multiple applications",
                        "rtl": "Led a project to convert outdated enzyme unit tests to React Testing Library",
                        "release": "Participated in midnight operations and releases",
                        "olt": "Performed load tests on the system to prepare for heavy server traffic"
                    }
                }
            },
            "tomlee": {
                "name": "Tom Lee Music Hong Kong",
                "period": "Jul 2022 - Feb 2023",
                "location": "Kowloon, Hong Kong",
                "title": "Web Programmer",
                "description": {
                    "website": "Maintained and implemented new features for the Tom Lee Music online store",
                    "server": "Managed internal network servers and computer systems",
                    "adhoc": "Resolved ad-hoc technical requests from colleagues"
                }
            }
        },
        "intern": {
            "title": "Internships",
            "aritaone": {
                "name": "AritaOne Software Ltd.",
                "period": "Nov 2020 - Dec 2021",
                "location": "Hong Kong Island, Hong Kong",
                "description": {
                    "frontend": "Responsible for designing and implementing Angular web applications for clients, mainly focusing on front-end development"
                }
            },
            "td": {
                "name": "Transport Department, HKSAR Government",
                "period": "Jul 2020 - Aug 2020",
                "location": "Kowloon, Hong Kong",
                "description": {
                    "revamp": "Revamped the divisional website using HTML, Bootstrap and jQuery",
                    "scheduler": "Developed an operation scheduler system as a web application with Node.js"
                }
            }
        },
        "education": {
            "title": "Education",
            "hkust": {
                "name": "The Hong Kong University of Science and Technology",
                "period": "Sep 2018 - Dec 2022",
                "location": "New Territories, Hong Kong",
                "title": "Bachelor of Engineering (BEng)",
                "description": {
                    "major": "Major in Computer Engineering",
                    "minor": "Minor in Humanities (Music)"
                }
            }
        }
    },
    "contact": {
        "title": "Let's get in touch!",
        "subtitle": "Whether you want to talk about projects, music, travel, or just say hi - I'd love to hear from you!"
    },
    "projects": {
        "title": "Side Projects",
        "subtitle": "A mix of little apps, experiments, and ideas I've brought to life — side projects that keep me learning and having fun.",
        "recipenotes": {
            "title": "Recipe Notes",
            "subtitle": "A simple and modern iOS app for organizing cooking recipes.",
            "privacy": {
                "title": "Privacy Policy for Recipe Notes",
                "subtitle": "Last updated: September 6, 2025",
                "content": {
                    "intro": "Recipe Notes respects your privacy. This Privacy Policy explains how your information is collected, used, and protected when you use our application.",
                    "data": {
                        "title": "Data Collection and Usage",
                        "collection": "We do not collect any personal data from users. All recipes and notes are stored locally on your device.",
                        "usage": "We do not track or monitor your usage of the app. All data remains private and is not shared with any third parties."
                    },
                    "advertising": {
                        "title": "Advertising",
                        "description": "In the future, Recipe Notes may include an optional feature where you can choose to watch ads to support the app.",
                        "info": "If you choose to watch an ad, the ad provider (e.g., Google AdMob) may collect certain non-personal information such as device identifiers, interaction with the ad, or approximate location.",
                        "handling": "This information is handled by the ad provider and not stored or controlled by Recipe Notes."
                    },
                    "analytics": {
                        "title": "Analytics",
                        "description": "We do not use any analytics or tracking tools beyond what is necessary to deliver ads (if you choose to watch them)."
                    },
                    "changes": "This Privacy Policy may be updated from time to time.",
                    "contact": "If you have any questions about this Privacy Policy, please feel free to reach out."
                }
            }
        },
        "portfolio": {
            "title": "Portfolio Website",
            "subtitle": "This very website you're on right now! Built with Next.js and Tailwind CSS."
        }
    }
}