{
    "navigation": {
        "home": "Home",
        "experiences": "Experiences",
        "contact": "Contact"
    },
    "home": {
        "title": "Hello!",
        "introduction": {
            "hi": "Hi, I'm Jay — a software engineer from Hong Kong, based in Tokyo, Japan.",
            "ios": "I build intuitive, user-friendly iOS applications using Swift and modern Apple frameworks, with a focus on creating smooth, elegant, and thoughtful user experiences.",
            "web": "Previously, I worked as a front-end web developer using React and TypeScript — a background that continues to shape how I think about structure, responsiveness, and design systems, now in the mobile space.",
            "love": "Beyond the screen, I'm someone who loves language, culture, and creativity.",
            "language": "I speak four languages — Cantonese, English, Mandarin and Japanese — and I enjoy working with people from diverse cultural and linguistic backgrounds. It's part of what makes collaboration feel both meaningful and natural to me.",
            "travel": "I've also explored 13 countries and visited 33 of Japan's 47 prefectures, driven by a love for culture and curiosity.",
            "music": "In my spare time, I turn to music. I play the piano and bass, and I occasionally transcribe or arrange songs just for fun.",
            "current": "I'm currently focusing on:",
            "focus": {
                "cert": "Studying for the Fundamental Information Technology Engineer Examination (基本情報技術者試験)",
                "japanese": "Improving my Japanese for both daily life and professional fluency",
                "piano": "Practicing piano regularly and arranging songs occasionally",
                "ios": "Deepening my iOS development skills with Swift, SwiftUI, and UIKit",
                "web": "Continuing to explore web development with Next.js to stay sharp with front-end trends"
            },
            "closing": "I'm always open to new ideas and fun conversations — feel free to reach out!"
        }
    },
    "experiences": {
        "title": "Experiences",
        "fulltime": {
            "title": "Full-time",
            "rakuten": {
                "company": "Rakuten Group Inc.",
                "period": "Apr 2023 - Present",
                "location": "Setagaya, Tokyo, Japan",
                "title": "Applications Engineer",
                "ios": {
                    "title": "iOS Team",
                    "description": {
                        "tbu": "Recently transitioned into the iOS team, where I'm beginning to contribute to app development. More updates soon!"
                    },
                    "skills": {}
                },
                "ui": {
                    "title": "UI Team",
                    "description": {
                        "inbound": "Worked as a front-end web developer for the Rakuten Travel Inbound website",
                        "ds": "Created a unified design system used across multiple applications",
                        "rtl": "Led a project to convert outdated enzyme unit tests to React Testing Library",
                        "release": "Participated in midnight operations and releases",
                        "olt": "Performed load tests on the system to prepare for heavy server traffic"
                    },
                    "skills": {}
                }
            },
            "tomlee": {
                "company": "Tom Lee Music Hong Kong",
                "period": "Jul 2022 - Feb 2023",
                "location": "Kowloon, Hong Kong",
                "title": "Web Programmer",
                "description": {
                    "website": "Maintained and implemented new features for the Tom Lee Music online store",
                    "server": "Managed internal network servers and computer systems",
                    "adhoc": "Resolved ad-hoc technical requests from colleagues"
                },
                "skills": {}
            }
        },
        "intern": {
            "title": "Internships",
            "itsc": {
                "company": "",
                "period": "",
                "description": "",
                "skills": {}
            },
            "aritaone": {
                "company": "",
                "period": "",
                "description": "",
                "skills": {}
            },
            "td": {
                "company": "",
                "period": "",
                "description": "",
                "skills": {}
            }
        },
        "education": {
            "hkust": {}
        }
    },
    "contact": {
        "title": "Contact"
    }
}